# YOLO11-SAFE: Scale-Adaptive Fine-grained Enhancement
# 主创新点配置: P2 检测头 + 跨尺度上下文注意力 (SCAA)
# 尺度引导标签分配 (SGLA) 通过训练参数 --scale_aware_boost 开启
#
# 三个子模块独立开关:
#   小点1 (P2):  本文件始终包含；消融时使用 yolo11.yaml 回退
#   小点2 (SCAA): 本文件包含；消融时使用 yolo11-p2.yaml 回退
#   小点3 (SGLA): 训练时 --scale_aware_boost 控制 (默认 0=禁用)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (与原版 YOLO11 完全相同)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]         # 9
  - [-1, 2, C2PSA, [1024]]           # 10

# Head (P2 分支 + SCAA 跨尺度注意力)
head:
  # ── 自顶向下: P5 → P4 ──
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # cat backbone P4
  - [-1, 2, C3k2, [512, False]]      # 13

  # ── P4 → P3 ──
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # cat backbone P3
  - [-1, 2, C3k2, [256, False]]      # 16 (P3/8)

  # ── P3 → P2 (新增 P2 分支) ──
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]        # cat backbone P2
  - [-1, 2, C3k2, [128, False]]      # 19 (P2/4)

  # ── SCAA: 跨尺度上下文注意力 (P2 + P3 融合) ──
  # 输入: 拼接 [P2 (layer 19) + P3 (layer 16)]
  # SCAA 内部已有残差连接 (x_shallow + x_deep * attn)
  # 输出: 增强后的 P2 特征，通道数与 layer 19 一致
  - [[-1, 16], 1, SCAA, [128]]       # 20: SCAA(P2←P3)

  # ── 自底向上: P2 → P3 ──
  - [-1, 1, Conv, [128, 3, 2]]       # 21
  - [[-1, 16], 1, Concat, [1]]       # cat head P3
  - [-1, 2, C3k2, [256, False]]      # 23 (P3/8)

  # ── P3 → P4 ──
  - [-1, 1, Conv, [256, 3, 2]]       # 24
  - [[-1, 13], 1, Concat, [1]]       # cat head P4
  - [-1, 2, C3k2, [512, False]]      # 26 (P4/16)

  # ── P4 → P5 ──
  - [-1, 1, Conv, [512, 3, 2]]       # 27
  - [[-1, 10], 1, Concat, [1]]       # cat head P5
  - [-1, 2, C3k2, [1024, True]]      # 29 (P5/32)

  # ── 4 尺度检测头 ──
  - [[20, 23, 26, 29], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
