# YOLO11 + P2 小目标检测头
# 在原版 YOLO11 基础上增加 P2/4 高分辨率检测层，增强小目标感知能力
# 参数量增加约 0.15M，FLOPs 增加约 1.5G

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (与原版 YOLO11 完全相同)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]         # 9
  - [-1, 2, C2PSA, [1024]]           # 10

# Head (增加 P2 分支)
head:
  # 自顶向下: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # cat backbone P4
  - [-1, 2, C3k2, [512, False]]      # 13

  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # cat backbone P3
  - [-1, 2, C3k2, [256, False]]      # 16 (P3/8-small)

  # P3 → P2 (新增分支)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]        # cat backbone P2
  - [-1, 2, C3k2, [128, False]]      # 19 (P2/4-xsmall)

  # 自底向上: P2 → P3
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]       # cat head P3
  - [-1, 2, C3k2, [256, False]]      # 22 (P3/8-small)

  # P3 → P4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]       # cat head P4
  - [-1, 2, C3k2, [512, False]]      # 25 (P4/16-medium)

  # P4 → P5
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]       # cat head P5
  - [-1, 2, C3k2, [1024, True]]      # 28 (P5/32-large)

  # 4 尺度检测头
  - [[19, 22, 25, 28], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
