# YOLO11-Ghost: 高效轻量化卷积设计 (副创新点)
# 在 Backbone 和 Neck 中用 GhostConv 替换部分标准 Conv
# C3Ghost 替换部分 C3k2 (轻量化 bottleneck)
# 预期: 参数量减少 ~20%, FLOPs 减少 ~25%, 精度基本持平
#
# 副创新点两个子模块:
#   小点1 (GhostConv): 本文件包含，通过 yaml 控制
#   小点2 (DWConv):    本文件包含，检测头中部分 3x3 Conv 使用 DWConv

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (GhostConv 替换部分 Conv)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2 (首层保留标准 Conv)
  - [-1, 1, GhostConv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, GhostConv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, GhostConv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, GhostConv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10

# Head (GhostConv 用于下采样)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]          # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]          # 16 (P3/8)

  - [-1, 1, GhostConv, [256, 3, 2]]      # 17 (下采样用 GhostConv)
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]          # 19 (P4/16)

  - [-1, 1, GhostConv, [512, 3, 2]]      # 20 (下采样用 GhostConv)
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]          # 22 (P5/32)

  - [[16, 19, 22], 1, Detect, [nc]]      # Detect(P3, P4, P5)
