# YOLO11-SAFE-Ghost-Neck: 仅 Neck 轻量化配置
# 主创新: P2 检测头 + SCAA 跨尺度注意力
# 副创新: GhostConv 仅用于 Neck 下采样路径 (保持 Backbone 完整)
# 设计思路: Backbone 保留标准 Conv 维持特征质量，Neck 底部上行路径用 GhostConv 减少参数
#
# 与 yolo11-safe-ghost.yaml 的区别:
#   - Backbone: 标准 Conv (非 GhostConv)，保持特征提取能力
#   - Neck 底部上行: GhostConv 轻量化下采样

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (与原版 YOLO11 完全相同，保留标准 Conv)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]         # 9
  - [-1, 2, C2PSA, [1024]]           # 10

# Head (P2 + SCAA + GhostConv 仅底部上行下采样)
head:
  # ── 自顶向下: P5 → P4 ──
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]      # 13

  # ── P4 → P3 ──
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]      # 16 (P3/8)

  # ── P3 → P2 (新增 P2 分支) ──
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]      # 19 (P2/4)

  # ── SCAA: 跨尺度上下文注意力 (P2 + P3 融合) ──
  - [[-1, 16], 1, SCAA, [128]]       # 20: SCAA(P2←P3)

  # ── 自底向上: P2 → P3 (GhostConv 轻量化下采样) ──
  - [-1, 1, GhostConv, [128, 3, 2]]  # 21
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]      # 23 (P3/8)

  # ── P3 → P4 (GhostConv 轻量化下采样) ──
  - [-1, 1, GhostConv, [256, 3, 2]]  # 24
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]      # 26 (P4/16)

  # ── P4 → P5 (GhostConv 轻量化下采样) ──
  - [-1, 1, GhostConv, [512, 3, 2]]  # 27
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]      # 29 (P5/32)

  # ── 4 尺度检测头 ──
  - [[20, 23, 26, 29], 1, Detect, [nc]]
