# YOLO11 + SCAA (仅跨尺度注意力，无 P2 分支)
# 消融实验: 小点2 单独验证
# SCAA 在 P3 层融合 P4 信息，内部残差连接增强 P3 特征

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (与原版 YOLO11 完全相同)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]         # 9
  - [-1, 2, C2PSA, [1024]]           # 10

# Head (在 P3 层增加 SCAA，无 P2 分支)
head:
  # 自顶向下: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # cat backbone P4
  - [-1, 2, C3k2, [512, False]]      # 13

  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # cat backbone P3
  - [-1, 2, C3k2, [256, False]]      # 16 (P3/8)

  # SCAA: 在 P3 层融合 P4 信息 (内部残差连接)
  # 输入: 拼接 [P3 (layer 16) + P4 (layer 13)]
  # SCAA 内部: x_shallow + x_deep * attn (残差)
  # 输出: 增强后的 P3 特征，通道数与 layer 16 一致
  - [[-1, 13], 1, SCAA, [256]]       # 17: SCAA(P3←P4)

  # 自底向上: P3 → P4
  - [-1, 1, Conv, [256, 3, 2]]       # 18
  - [[-1, 13], 1, Concat, [1]]       # cat head P4
  - [-1, 2, C3k2, [512, False]]      # 20 (P4/16)

  # P4 → P5
  - [-1, 1, Conv, [512, 3, 2]]       # 21
  - [[-1, 10], 1, Concat, [1]]       # cat head P5
  - [-1, 2, C3k2, [1024, True]]      # 23 (P5/32)

  # 3 尺度检测头 (无 P2)
  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
